RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_spi.h
    uint32_t FifoThreshold;                     /*!< Specifies the FIFO threshold level. 
                                                     This parameter can be a value of @ref SPI_Fifo_Threshold */
                                                
    uint32_t TxCRCInitializationPattern;        /*!< Specifies the transmitter CRC initialization Pattern used for the CRC calculation.
                                                     This parameter can be a value of @ref SPI_CRC_Calculation_Initialization_Pattern */
                                                
    uint32_t RxCRCInitializationPattern;        /*!< Specifies the receiver CRC initialization Pattern used for the CRC calculation.
                                                     This parameter can be a value of @ref SPI_CRC_Calculation_Initialization_Pattern */

    uint32_t MasterSSIdleness;                  /*!< Specifies an extra delay, expressed in number of SPI clock cycle periods, inserted 
                                                     additionally between active edge of SS and first data transaction start in master mode.
                                                     This parameter can be a value of @ref SPI_Master_SS_Idleness */

    uint32_t MasterInterDataIdleness;           /*!< Specifies minimum time delay (expressed in SPI clock cycles periods) inserted between 
                                                     two consecutive data frames in master mode
                                                     This parameter can be a value of @ref SPI_Master_InterData_Idleness */

    uint32_t MasterReceiverAutoSusp;            /*!< Control continuous SPI transfer in master receiver mode and automatic management 
                                                     in order to avoid overrun condition. 
                                                     This parameter can be a value of @ref SPI_Master_RX_AutoSuspend*/

    uint32_t MasterKeepIOState;                 /*!< Control of Alternate function GPIOs state
                                                     This parameter can be a value of @ref SPI_Master_Keep_IO_State */

    uint32_t IOSwap;                            /*!< Invert MISO/MOSI alternate functions
                                                     This parameter can be a value of @ref SPI_IO_Swap */

} SPI_InitTypeDef;

/**
  * @brief  HAL SPI State structure definition
  */
typedef enum
{
    HAL_SPI_STATE_RESET      = 0x00U,    /*!< Peripheral not Initialized                         */
    HAL_SPI_STATE_READY      = 0x01U,    /*!< Peripheral Initialized and ready for use           */
    HAL_SPI_STATE_BUSY       = 0x02U,    /*!< an internal process is ongoing                     */
    HAL_SPI_STATE_BUSY_TX    = 0x03U,    /*!< Data Transmission process is ongoing               */
    HAL_SPI_STATE_BUSY_RX    = 0x04U,    /*!< Data Reception process is ongoing                  */
    HAL_SPI_STATE_BUSY_TX_RX = 0x05U,    /*!< Data Transmission and Reception process is ongoing */
    HAL_SPI_STATE_ERROR      = 0x06U,    /*!< SPI error state                                    */
    HAL_SPI_STATE_ABORT      = 0x07U     /*!< SPI abort is ongoing                               */
} HAL_SPI_StateTypeDef;

/**
  * @brief  SPI handle Structure definition
  */
typedef struct __SPI_HandleTypeDef
{
    SPI_TypeDef                *Instance;                    /*!< SPI registers base address               */

    SPI_InitTypeDef            Init;                         /*!< SPI communication parameters             */

    uint8_t                    *pTxBuffPtr;                  /*!< Pointer to SPI Tx transfer Buffer        */

    uint16_t                   TxXferSize;                   /*!< SPI Tx Transfer size                     */

    __IO uint16_t              TxXferCount;                  /*!< SPI Tx Transfer Counter                  */

    uint8_t                    *pRxBuffPtr;                  /*!< Pointer to SPI Rx transfer Buffer        */

    uint16_t                   RxXferSize;                   /*!< SPI Rx Transfer size                     */

    __IO uint16_t              RxXferCount;                  /*!< SPI Rx Transfer Counter                  */

    uint32_t                   CRCSize;                      /*!< SPI CRC size used for the transfer       */

    void (*RxISR)(struct __SPI_HandleTypeDef *hspi);         /*!< function pointer on Rx ISR               */

    void (*TxISR)(struct __SPI_HandleTypeDef *hspi);         /*!< function pointer on Tx ISR               */

    DMA_HandleTypeDef          *hdmatx;                      /*!< SPI Tx DMA Handle parameters             */

    DMA_HandleTypeDef          *hdmarx;                      /*!< SPI Rx DMA Handle parameters             */

    HAL_LockTypeDef            Lock;                         /*!< Locking object                           */

    __IO HAL_SPI_StateTypeDef  State;                        /*!< SPI communication state                  */

    __IO uint32_t              ErrorCode;                    /*!< SPI Error code                           */

} SPI_HandleTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup SPI_Exported_Constants SPI Exported Constants
  * @{
  */

/** @defgroup SPI_FIFO_Type SPI FIFO Type
  * @{
  */
#define SPI_LOWEND_FIFO_SIZE            8U
#define SPI_HIGHEND_FIFO_SIZE           16U
/**
  * @}
  */

/** @defgroup SPI_Error_Code SPI Error Codes
  * @{
  */
#define HAL_SPI_ERROR_NONE              (0x00000000U)   /*!< No error                               */
#define HAL_SPI_ERROR_MODF              (0x00000001U)   /*!< MODF error                             */
#define HAL_SPI_ERROR_CRC               (0x00000002U)   /*!< CRC error                              */
#define HAL_SPI_ERROR_OVR               (0x00000004U)   /*!< OVR error                              */
#define HAL_SPI_ERROR_FRE               (0x00000008U)   /*!< FRE error                              */
#define HAL_SPI_ERROR_DMA               (0x00000010U)   /*!< DMA transfer error                     */
#define HAL_SPI_ERROR_FLAG              (0x00000020U)   /*!< Error on RXNE/TXE/BSY/FTLVL/FRLVL Flag */
#define HAL_SPI_ERROR_ABORT             (0x00000040U)   /*!< Error during SPI Abort procedure       */
#define HAL_SPI_ERROR_UDR               (0x00000080U)   /*!< Underrun error                         */
#define HAL_SPI_ERROR_TIMEOUT           (0x00000100U)   /*!< Timeout error                          */
#define HAL_SPI_ERROR_UNKNOW            (0x00000200U)   /*!< Unknow error                           */
/**
  * @}
  */

/** @defgroup SPI_Mode SPI Mode
  * @{
  */
#define SPI_MODE_SLAVE                  (0x00000000U)
#define SPI_MODE_MASTER                 SPI_CFG2_MASTER
/**
  * @}
  */

/** @defgroup SPI_Direction SPI Direction Mode
  * @{
  */
#define SPI_DIRECTION_2LINES            (0x00000000U)
#define SPI_DIRECTION_2LINES_TXONLY     SPI_CFG2_COMM_0
#define SPI_DIRECTION_2LINES_RXONLY     SPI_CFG2_COMM_1
#define SPI_DIRECTION_1LINE             SPI_CFG2_COMM
/**
  * @}
  */

/** @defgroup SPI_Data_Size SPI Data Size
  * @{
  */
#define SPI_DATASIZE_4BIT               (0x00000003U)
#define SPI_DATASIZE_5BIT               (0x00000004U)
#define SPI_DATASIZE_6BIT               (0x00000005U)
#define SPI_DATASIZE_7BIT               (0x00000006U)
#define SPI_DATASIZE_8BIT               (0x00000007U)
#define SPI_DATASIZE_9BIT               (0x00000008U)
#define SPI_DATASIZE_10BIT              (0x00000009U)
#define SPI_DATASIZE_11BIT              (0x0000000AU)
#define SPI_DATASIZE_12BIT              (0x0000000BU)
#define SPI_DATASIZE_13BIT              (0x0000000CU)
#define SPI_DATASIZE_14BIT              (0x0000000DU)
#define SPI_DATASIZE_15BIT              (0x0000000EU)
#define SPI_DATASIZE_16BIT              (0x0000000FU)
#define SPI_DATASIZE_17BIT              (0x00000010U)
#define SPI_DATASIZE_18BIT              (0x00000011U)
#define SPI_DATASIZE_19BIT              (0x00000012U)
#define SPI_DATASIZE_20BIT              (0x00000013U)
#define SPI_DATASIZE_21BIT              (0x00000014U)
#define SPI_DATASIZE_22BIT              (0x00000015U)
#define SPI_DATASIZE_23BIT              (0x00000016U)
#define SPI_DATASIZE_24BIT              (0x00000017U)
#define SPI_DATASIZE_25BIT              (0x00000018U)
#define SPI_DATASIZE_26BIT              (0x00000019U)
#define SPI_DATASIZE_27BIT              (0x0000001AU)
#define SPI_DATASIZE_28BIT              (0x0000001BU)
#define SPI_DATASIZE_29BIT              (0x0000001CU)
#define SPI_DATASIZE_30BIT              (0x0000001DU)
#define SPI_DATASIZE_31BIT              (0x0000001EU)
#define SPI_DATASIZE_32BIT              (0x0000001FU)
/**
  * @}
  */

/** @defgroup SPI_Clock_Polarity SPI Clock Polarity
  * @{
  */
#define SPI_POLARITY_LOW                (0x00000000U)
#define SPI_POLARITY_HIGH               SPI_CFG2_CPOL
/**
  * @}
  */

/** @defgroup SPI_Clock_Phase SPI Clock Phase
  * @{
  */
#define SPI_PHASE_1EDGE                 (0x00000000U)
#define SPI_PHASE_2EDGE                 SPI_CFG2_CPHA
/**
  * @}
  */

/** @defgroup SPI_Slave_Select_Management SPI Slave Select Management
  * @{
  */
#define SPI_NSS_SOFT                    SPI_CFG2_SSM
#define SPI_NSS_HARD_INPUT              (0x00000000U)
#define SPI_NSS_HARD_OUTPUT             SPI_CFG2_SSOE
/**
  * @}
  */

/** @defgroup SPI_NSSP_Mode SPI NSS Pulse Mode
  * @{
  */
#define SPI_NSS_PULSE_DISABLE           (0x00000000U)
#define SPI_NSS_PULSE_ENABLE            SPI_CFG2_SSOM
/**
  * @}
  */

